Revit 2024 API
IFCExtrusionData.ExtrusionDirection Property
 The direction used for the extrusion.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public XYZ ExtrusionDirection { get; set; }
Visual Basic
Public Property ExtrusionDirection As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ ExtrusionDirection {
	XYZ^ get ();
	void set (XYZ^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
IFCExtrusionData Class
Autodesk.Revit.DB.IFC Namespace